Repository: adoleba/personal_site_draft
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pl

source: Please fill your name
pl: Uzupełnij swoje dane

source: Please fill your email address
pl: Uzupełnij swój adres e-mail

source: The email address is not valid
pl: Podany adres e-mail jets niepoprawny

source: Please fill the subject of the message
pl: Uzupełnij temat wiadomości

source: Please fill the content of message
pl: Uzupełnij treść wiadomości

source: thank-you/
pl: dziekuje/

source: english
pl: angielski

source: polish
pl: Polski

source: about/
pl: o-mnie

source: contact/
pl: kontakt/

source: projects/
pl: projekty

source: Skills and technologies
pl: Co potrafię?

source: During my education, I worked mainly with the belowe technologies/languages​​/frameworks.
pl: Podczas mojej edukacji pracowałam głównie z następującymi technologiami/językami/frameworkami.

source: I am open to new knowledge and new technologies, so this list is not closed and will grow with the increase of professional experience
pl: Jestem otwarta na nową wiedzę i nowe technologie, więc lista ta nie jest zamknięta i będzie rosła wraz ze wzrostem doświadczenia zawodowego

source: Most important libraries:
pl: Najważniejsze biblioteki:

source: API, returning JSON Data, serialization
pl: API, zwracanie danych w formacie JSON, serializacja

source: Dynamic content on pages
pl: Dynamiczna zawartość stron

source: Content Management System (CMS) using interchangeably with django-admin, mainly for users with no IT skills
pl: System Zarządzania Treścią (CMS) używany zamiennie z django-admin, głównie dla użytkowników nie znających HTMLa

source: Scraping elements from requested url (using css selectors), displaying them in shell or saving into file
pl: Pobieranie elementów z zadanego adresu url (wykorzystując selektory css), wyświetlanie ich w konsoli, zapisywanie do pliku

source: I use integrated development environment (PyCharm) at work
pl: W pracy korzystam ze zintegrowanego środowiska produkcyjnego (IDE) - Pycharm

source: Work according to Git Workflow, commits are assigned to branches, pull request before merging changes
pl: Praca zgodnie z Git Workflow, commity są przypisane do branchy, pull requesty przed zmergowaniem zmian

source: Templates in applications with use of Jinja engine
pl: Wykorzystanie w templatkach silnika Jinja

source: Responsive Web Design (RWD), projects are designed according to methodology Mobile First
pl: Responsywne widoki (RWD), projekty są tworzone zgodnie z metodyką Mobile First

source: Bootstrap 4 SCSS, installed to projects via npm and compiled via node-scss
pl: Bootstrap 4 SCSS instalowany w projekcie z wykorzystaniem npm i kompilowany przez node-scss

source: Databases
pl: Bazy danych

source: Contact me
pl: Skontaktuj się ze mną

source: If you are interested in cooperating with me, please don't hesitate to contact me.
pl: Jeśli jesteś zainteresowana/zainteresowany podjęciem ze mną współpracy, napisz.

source: You can use the contact form below or via my email: ania.doleba[at]wp.pl.
pl: Możesz użyć poniższego formularza kontaktowego, bądź bezpośrednio przez e-maila: ania.doleba[at]wp.pl.

source: Name
pl: Imię i nazwisko

source: Subject
pl: Temat wiadomości

source: Content
pl: Treść wiadomości

source: Send
pl: Wyślij

source: Thank you for the message.
pl: Dziękuję za przesłaną wiadomość.

source: I will respond as soon as possible.
pl: Odpowiem najszybciej jak to możliwe.

source: Back to homepage
pl: Powrót na stronę główną

source: HOME
pl: STRONA GŁÓWNA

source: ABOUT
pl: O MNIE

source: PROJECTS
pl: PROJEKTY

source: CONTACT
pl: KONTAKT

source: Who am I?
pl: Kilka słów o mnie

source: Master of Science in Management and Production Engineering, specializing in Product Quality Management.
pl: Mgr inż. Zarządzania i Inżynierii Produkcji, ze specjalnością Zarządzanie Jakością Produktu.

source: Self learned Python programmer, working in Django and Flask Frameworks.
pl: Pythonowy samouk, pracujący we frameworkach Django i Flask.

source: An ambitious perfectionist, analytically approaching problems, considering various options before making a decision.
pl: Ambitna perfekcjonistka, rozwiązująca problemy analitycznie, rozważająca wiele opcji przed podjęciem decyzji.

source: Read more
pl: Więcej

source: My projects
pl: Moje projekty

source: During my education I created several projects. All of them it were my ideas.
pl: Podczas nauki stworzyłam kilka swoich projektów, koncepcja większości z nich była moim własnym pomysłem.

source: Design of some of them is based on implementation bought html template,
pl: Wygląd części z nich opiera się na zaimplementowaniu kupionej gotowej templatki html,

source: some of projects was designed with using Bootstrap on the base of .psd file, and some I designed by my own, using Bootstrap.
pl: część została zaprojektowana z użyciem Bootstrapa do zakodowania pliku .psd, a część na podstawie własnej koncepcji, z wykorzystaniem biblioteki Bootstrap.

source: Are you interested in cooperating with me?
pl: Jesteś zainteresowany podjęciem współpracy ze mną?

source: Choose language
pl: Wybierz język

source: Simple Django app, which adds the same task to the Toggl account for chosen dates and hours.
pl: Prosta aplikacja we frameworku Django, która dodaje do konta Toggl zadania powtarzalne w określonych datach i godzinach.

source: Go to the project
pl: Projekt

source: Go to Github
pl: Kod na GitHub-ie

source: Sample of cms blog using django-admin with additional contact page, which can be edited from admin page.
pl: Przykład bloga CMS z wykorzystaniem panelu administracyjnego Django, wraz z dodatkową stroną kontaktową, która również jest edytowana z poziomu panelu administracyjnego.

source: Posts are sorted and can be filtered in categories. Readers can leave comments.
pl: Posty są posortowane i mogą być filtrowane według kategorii. Czytelnicy mogą komentować posty.

source: Blog has implemented API in django rest framework.
pl: Blog posiada zaimplementowane API w Django Rest Framework.

source: Company site with blog
pl: Strona firmowa z blogiem

source: Sample of company site with blog in Flask using Flask-admin module. Every page can be edited in flask-admin panel.
pl: Przykładowa strona firmowa z blogiem we frameworku Flask, wykorzystująca moduł flask-admin. Każda strona może być edytowana poprzez panel administracyjny.

source: Every registered user can add posts on blog, possibility of editing other pages only for superusers.
pl: Każdy zarejestrowany użytkownik może dodawać posty na blogu, możliwość edycji pozostałych stron tylko dla superuserów.

source: Superusers can also add new pages from defined modules.
pl: Superuserzy mogą również dodawać nowe strony z wykorzystaniem stworzonych modułów.

source: Sample of company site with blog using Wagtail CMS. Every page can be edited in Wagtail-admin.
pl: Przykład strony firmowej z blogiem z wykorzystaniem CMSa Wagtail. Każda strona może być edytowana w panelu administracyjnym Wagtail.

source: Admin can add own pages from defined blocks. Readers can leave comments to posts.
pl: Użytkownik ze statusem administratora może dodać stronę w wykorzystaniem zdefiniowanych wcześniej modułów. Czytelnicy mają możliwość komentowania postów.

source: Script crawling books from shop helion.pl from category set in start_urls.
pl: Skrypt pobierający wszystkie książki ze sklepu internetowego helion.pl (kategorii podanej w parametrze start_urls).

source: Books are crawled with theirs title, author, price
pl: Pozycje są pobierane z tytułem, autorem, ceną

source: (or special price if there is promotion, if product is temporarily unavailable, with this information),
pl: (lub ceną specjalną, jeśli produkt aktualnie jest w promocji, w przypadku chwilowego braku dostępności produktu, skrypt zwraca stosowną informację),

source: price category (<50 zł, 50-100 zł, 100-150 zł, >100 zł) and saved into .csv file.
pl: kategorią cenową (<50 zł, 50-100 zł, 100-150 zł, >100 zł) i zapisywane w pliku .csv.

source: Personal site
pl: Strona osobista

source: This site, Django app using Bootstrap.
pl: Przeglądana strona, aplikacja Django, z wykorzystaniem Bootstrapa

source: Page bilingual - depending on localization, users can switch languages - between polish and english.
pl: Strona dwujęzyczna zależnie od lokalizacji, użytkownicy mogą przełączać między językiem polskim i angielskim.

source: Simple Django application to manage a collection of books (with their authors and categories).
pl: Prosta aplikacja we frameworku Django do zarządzania zbiorem książek (wraz z ich autorami i kategoriami).

source: The application has the ability to filter by author and category,
pl: Aplikacja posiada możliwość filtrowania po autorach i kategorii,

source: manually add a book and import books by keywords from the Google API.
pl: ręczne dodawanie pozycji oraz import według słów kluczowych z Google API.

source: Recruitment task, which was performed to check one's own skills, application's appearance did not matter.
pl: Zadanie rekrutacyjne, wykonane w celu sprawdzenia własnych umiejętności, wygląd aplikacji nie miał znaczenia.

source: Administration Panel
pl: Panel administracyjny

source: Custom admin panel for blog with use of Pyramid framework. Different permissions for authors and administrators.
pl: Własny panel administracyjny do bloga, wykorzystujący Pyramida jako framework. Autorzy i administratorzy posiadają różne uprawnienia.

source: Project also contains a simple blog view with post's filtering by categories in navbar.
pl: W projekcie jest również prosty widok bloga, filtrujący w pasku nawigacyjnym posty według kategorii.

source: Shop
pl: Sklep

source: Sample of shop in Vue, using Bootstrap. Products can be filtered depending on category.
pl: Przykładowy sklep w Vue, z wykorzystaniem Bootstrapa. Produkty mogą być filtrowane w zależności od kategorii.

source: Users add product to cart, in cart it is possible to change quantity.
pl: Użytkownicy dodają produkty do koszyka, w koszyku można zmienić ilość.

source: Then they fill shipping data and choose a delivery method.
pl: Następnie uzupełniają dane i wybierają metodę wysyłki.

source: Data can be provided with usage of FastAPI.
pl: Dane mogą dostać dostarczone z wykorzystaniem FastAPI.
